ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
<module name="CONTROLSS_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" offset="4" width="32" description="Static crossbar for epwm select.">
		<bitfield id="EPWM_STATICXBAR_SEL0_EPWM15" width="2" begin="31" end="30" resetval="0x0" description="EPWM15 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="31:30" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM14" width="2" begin="29" end="28" resetval="0x0" description="EPWM14 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="29:28" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM13" width="2" begin="27" end="26" resetval="0x0" description="EPWM13 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="27:26" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM12" width="2" begin="25" end="24" resetval="0x0" description="EPWM12 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="25:24" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM11" width="2" begin="23" end="22" resetval="0x0" description="EPWM11 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="23:22" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM10" width="2" begin="21" end="20" resetval="0x0" description="EPWM10 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="21:20" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM9" width="2" begin="19" end="18" resetval="0x0" description="EPWM9 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="19:18" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM8" width="2" begin="17" end="16" resetval="0x0" description="EPWM8 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="17:16" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM7" width="2" begin="15" end="14" resetval="0x0" description="EPWM7 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="15:14" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM6" width="2" begin="13" end="12" resetval="0x0" description="EPWM6 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="13:12" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM5" width="2" begin="11" end="10" resetval="0x0" description="EPWM5 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="11:10" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM4" width="2" begin="9" end="8" resetval="0x0" description="EPWM4 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="9:8" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM3" width="2" begin="7" end="6" resetval="0x0" description="EPWM3 access from PCR grouping. Write the following value to access groups  -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="7:6" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM2" width="2" begin="5" end="4" resetval="0x0" description="EPWM2 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="5:4" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM1" width="2" begin="3" end="2" resetval="0x0" description="EPWM1 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="3:2" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL0_EPWM0" width="2" begin="1" end="0" resetval="0x0" description="EPWM0 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" offset="8" width="32" description="Static crossbar for epwm select.">
		<bitfield id="EPWM_STATICXBAR_SEL1_EPWM31" width="2" begin="31" end="30" resetval="0x0" description="EPWM31 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="31:30" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM30" width="2" begin="29" end="28" resetval="0x0" description="EPWM30 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="29:28" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM29" width="2" begin="27" end="26" resetval="0x0" description="EPWM29 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="27:26" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM28" width="2" begin="25" end="24" resetval="0x0" description="EPWM28 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="25:24" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM27" width="2" begin="23" end="22" resetval="0x0" description="EPWM27 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="23:22" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM26" width="2" begin="21" end="20" resetval="0x0" description="EPWM26 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="21:20" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM25" width="2" begin="19" end="18" resetval="0x0" description="EPWM25 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="19:18" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM24" width="2" begin="17" end="16" resetval="0x0" description="EPWM24 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="17:16" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM23" width="2" begin="15" end="14" resetval="0x0" description="EPWM23 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="15:14" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM22" width="2" begin="13" end="12" resetval="0x0" description="EPWM22 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="13:12" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM21" width="2" begin="11" end="10" resetval="0x0" description="EPWM21 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="11:10" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM20" width="2" begin="9" end="8" resetval="0x0" description="EPWM20 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="9:8" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM19" width="2" begin="7" end="6" resetval="0x0" description="EPWM19 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="7:6" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM18" width="2" begin="5" end="4" resetval="0x0" description="EPWM18 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="5:4" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM17" width="2" begin="3" end="2" resetval="0x0" description="EPWM17 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="3:2" rwaccess="R/W"/>
	<bitfield id="EPWM_STATICXBAR_SEL1_EPWM16" width="2" begin="1" end="0" resetval="0x0" description="EPWM16 access from PCR grouping. Write the following value to access groups - -  2'b00 = G0, 2'b01 =G1, 2'b10 =G2, 2'b11 =G3" range="1:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM_CLKSYNC" acronym="CONTROLSS_CTRL_EPWM_CLKSYNC" offset="16" width="32" description="Epwm clock sync.">
		<bitfield id="EPWM_CLKSYNC_BIT" width="32" begin="31" end="0" resetval="0x0" description="EPWM clock sync for each EPWM instance. Set the bit corresponding to the instance number to enable that EPWM instance. When set, all enabled EPWM module clocks are started with the first rising edge of TBCLK aligned.Refer to TRM for more details.Writing 1'b1 will allow to enable corresponding EPWM instanceWriting 1'b0 will disable corresponding  EPWM instance." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK0_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK0_SEL" offset="24" width="32" description="Sdfm1 clock select.">
		<bitfield id="SDFM1_CLK0_SEL_SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1 clock CK0 selectWrite 1'b0: source is SDFM1 CK0 from PinmuxWrite 1'b1: source is SDFM0 CK0 from Pinmux" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EMUSTOPN_MASK" acronym="CONTROLSS_CTRL_EMUSTOPN_MASK" offset="32" width="32" description="Bit-mask for debug suspend cpu cores to EPWM.">
		<bitfield id="EMUSTOPN_MASK_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS1_CORE1 enabled to control EMUSTOPn1'b1 : R5FSS1_CORE1 disabled to control EMUSTOPn" range="3" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS1_CORE0 enabled to control EMUSTOPn1'b1 : R5FSS1_CORE0 disabled to control EMUSTOPn" range="2" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS0_CORE1 enabled to control EMUSTOPn1'b1 : R5FSS0_CORE1 disabled to control EMUSTOPn" range="1" rwaccess="R/W"/>
	<bitfield id="EMUSTOPN_MASK_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM1'b0 : R5FSS0_CORE0 enabled to control EMUSTOPn1'b1 : R5FSS0_CORE0 disabled to control EMUSTOPn" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_AQ_EN0" acronym="CONTROLSS_CTRL_CLB_AQ_EN0" offset="40" width="32" description="clb_aq_en0.">
		<bitfield id="CLB_AQ_EN0_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[15:0]. Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 0-15." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_AQ_EN1" acronym="CONTROLSS_CTRL_CLB_AQ_EN1" offset="48" width="32" description="clb_aq_en1.">
		<bitfield id="CLB_AQ_EN1_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[31:16].Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 16-31." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_DB_EN0" acronym="CONTROLSS_CTRL_CLB_DB_EN0" offset="56" width="32" description="clb_db_en0.">
		<bitfield id="CLB_DB_EN0_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[15:0]. Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 0-15." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CLB_DB_EN1" acronym="CONTROLSS_CTRL_CLB_DB_EN1" offset="64" width="32" description="clb_db_en1.">
		<bitfield id="CLB_DB_EN1_ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[31:16].Set Bitx to 1'b1 to enable it for PWMx. Here x varies from 16-31." range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM0_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM0_CLK_GATE" offset="256" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM1_CLK_GATE" offset="260" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM2_CLK_GATE" offset="264" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM3_CLK_GATE" offset="268" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM4_CLK_GATE" offset="272" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM5_CLK_GATE" offset="276" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM6_CLK_GATE" offset="280" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM7_CLK_GATE" offset="284" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM8_CLK_GATE" offset="288" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM9_CLK_GATE" offset="292" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM10_CLK_GATE" offset="296" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM10_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM11_CLK_GATE" offset="300" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM11_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM12_CLK_GATE" offset="304" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM12_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM13_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM13_CLK_GATE" offset="308" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM13_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM14_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM14_CLK_GATE" offset="312" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM14_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM15_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM15_CLK_GATE" offset="316" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM15_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM16_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM16_CLK_GATE" offset="320" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM16_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM17_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM17_CLK_GATE" offset="324" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM17_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM18_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM18_CLK_GATE" offset="328" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM18_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM19_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM19_CLK_GATE" offset="332" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM19_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM20_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM20_CLK_GATE" offset="336" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM20_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM21_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM21_CLK_GATE" offset="340" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM21_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM22_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM22_CLK_GATE" offset="344" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM22_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM23_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM23_CLK_GATE" offset="348" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM23_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM24_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM24_CLK_GATE" offset="352" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM24_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM25_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM25_CLK_GATE" offset="356" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM25_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM26_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM26_CLK_GATE" offset="360" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM26_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM27_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM27_CLK_GATE" offset="364" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM27_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM28_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM28_CLK_GATE" offset="368" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM28_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM29_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM29_CLK_GATE" offset="372" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM29_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM30_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM30_CLK_GATE" offset="376" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM30_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM31_CLK_GATE" acronym="CONTROLSS_CTRL_EPWM31_CLK_GATE" offset="380" width="32" description="To clock gate epwm[x].">
		<bitfield id="EPWM31_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" offset="384" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" offset="388" width="32" description="fsi_tx[x] clock gate.">
