ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
		<bitfield id="FSI_TX1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" offset="392" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" offset="396" width="32" description="fsi_tx[x] clock gate.">
		<bitfield id="FSI_TX3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_tx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" offset="400" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" offset="404" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" offset="408" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" offset="412" width="32" description="fsi_rx[x] clock gate.">
		<bitfield id="FSI_RX3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi_rx" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" offset="416" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" offset="420" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" offset="424" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" offset="428" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" offset="432" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" offset="436" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" offset="440" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" offset="444" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" offset="448" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" offset="452" width="32" description="cmpssa[x] clock gate.">
		<bitfield id="CMPSSA9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssa" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" offset="464" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" offset="468" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" offset="472" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" offset="476" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" offset="480" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" offset="484" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" offset="488" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" offset="492" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" offset="496" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" offset="500" width="32" description="cmpssb[x] clock gate.">
		<bitfield id="CMPSSB9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding cmpssb" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP0_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP0_CLK_GATE" offset="512" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP1_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP1_CLK_GATE" offset="516" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP2_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP2_CLK_GATE" offset="520" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP3_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP3_CLK_GATE" offset="524" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP4_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP4_CLK_GATE" offset="528" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP5_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP5_CLK_GATE" offset="532" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP5_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP6_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP6_CLK_GATE" offset="536" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP6_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP7_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP7_CLK_GATE" offset="540" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP7_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP8_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP8_CLK_GATE" offset="544" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP8_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP9_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP9_CLK_GATE" offset="548" width="32" description="Ecap[x] clock gate.">
		<bitfield id="ECAP9_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding ecap" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP0_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP0_CLK_GATE" offset="576" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP1_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP1_CLK_GATE" offset="580" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP2_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP2_CLK_GATE" offset="584" width="32" description="Eqep[x] clock gate.">
		<bitfield id="EQEP2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding eqep" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_CLK_GATE" offset="592" width="32" description="Sdfm[x] clock gate.">
		<bitfield id="SDFM0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_CLK_GATE" offset="596" width="32" description="Sdfm[x] clock gate.">
		<bitfield id="SDFM1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_DAC_CLK_GATE" acronym="CONTROLSS_CTRL_DAC_CLK_GATE" offset="600" width="32" description="dac clock gate.">
		<bitfield id="DAC_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for dac" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC0_CLK_GATE" acronym="CONTROLSS_CTRL_ADC0_CLK_GATE" offset="604" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC1_CLK_GATE" acronym="CONTROLSS_CTRL_ADC1_CLK_GATE" offset="608" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC2_CLK_GATE" acronym="CONTROLSS_CTRL_ADC2_CLK_GATE" offset="612" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC3_CLK_GATE" acronym="CONTROLSS_CTRL_ADC3_CLK_GATE" offset="616" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ADC4_CLK_GATE" acronym="CONTROLSS_CTRL_ADC4_CLK_GATE" offset="620" width="32" description="Adc[x] clock gate.">
		<bitfield id="ADC4_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding adc" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO0_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO0_CLK_GATE" offset="624" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO0_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO1_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO1_CLK_GATE" offset="628" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO1_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO2_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO2_CLK_GATE" offset="632" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO2_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_OTTO3_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO3_CLK_GATE" offset="636" width="32" description="Otto[x] clock gate.">
		<bitfield id="OTTO3_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding otto" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" offset="640" width="32" description="Sdfm[x]_pll clock gate.">
		<bitfield id="SDFM0_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" offset="644" width="32" description="Sdfm[x]_pll clock gate.">
		<bitfield id="SDFM1_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding sdfm pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" offset="648" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX0_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" offset="652" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX1_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" offset="656" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX2_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" offset="660" width="32" description="fsi_tx[x]_pll clock gate.">
		<bitfield id="FSI_TX3_PLL_CLK_GATE_CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will gate clock for corresponding fsi rx pll clock" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM0_RST" acronym="CONTROLSS_CTRL_EPWM0_RST" offset="768" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM0_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_RST" acronym="CONTROLSS_CTRL_EPWM1_RST" offset="772" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM1_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_RST" acronym="CONTROLSS_CTRL_EPWM2_RST" offset="776" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM2_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_RST" acronym="CONTROLSS_CTRL_EPWM3_RST" offset="780" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM3_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_RST" acronym="CONTROLSS_CTRL_EPWM4_RST" offset="784" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM4_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_RST" acronym="CONTROLSS_CTRL_EPWM5_RST" offset="788" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM5_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_RST" acronym="CONTROLSS_CTRL_EPWM6_RST" offset="792" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM6_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_RST" acronym="CONTROLSS_CTRL_EPWM7_RST" offset="796" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM7_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_RST" acronym="CONTROLSS_CTRL_EPWM8_RST" offset="800" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM8_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_RST" acronym="CONTROLSS_CTRL_EPWM9_RST" offset="804" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM9_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_RST" acronym="CONTROLSS_CTRL_EPWM10_RST" offset="808" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM10_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_RST" acronym="CONTROLSS_CTRL_EPWM11_RST" offset="812" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM11_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_RST" acronym="CONTROLSS_CTRL_EPWM12_RST" offset="816" width="32" description="Epwm[x]_reset.">
		<bitfield id="EPWM12_RST_RST" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111 will generate reset for corresponding epwm" range="2:0" rwaccess="R/W"/>
