ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	<bitfield id="EPWM0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM1_HALTEN" acronym="CONTROLSS_CTRL_EPWM1_HALTEN" offset="1284" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM2_HALTEN" acronym="CONTROLSS_CTRL_EPWM2_HALTEN" offset="1288" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM3_HALTEN" acronym="CONTROLSS_CTRL_EPWM3_HALTEN" offset="1292" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM4_HALTEN" acronym="CONTROLSS_CTRL_EPWM4_HALTEN" offset="1296" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM5_HALTEN" acronym="CONTROLSS_CTRL_EPWM5_HALTEN" offset="1300" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM6_HALTEN" acronym="CONTROLSS_CTRL_EPWM6_HALTEN" offset="1304" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM7_HALTEN" acronym="CONTROLSS_CTRL_EPWM7_HALTEN" offset="1308" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM8_HALTEN" acronym="CONTROLSS_CTRL_EPWM8_HALTEN" offset="1312" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM9_HALTEN" acronym="CONTROLSS_CTRL_EPWM9_HALTEN" offset="1316" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM10_HALTEN" acronym="CONTROLSS_CTRL_EPWM10_HALTEN" offset="1320" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM10_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM10_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM11_HALTEN" acronym="CONTROLSS_CTRL_EPWM11_HALTEN" offset="1324" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM11_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM11_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM12_HALTEN" acronym="CONTROLSS_CTRL_EPWM12_HALTEN" offset="1328" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM12_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM12_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM12_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM12_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM13_HALTEN" acronym="CONTROLSS_CTRL_EPWM13_HALTEN" offset="1332" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM13_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM13_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM13_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM13_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM14_HALTEN" acronym="CONTROLSS_CTRL_EPWM14_HALTEN" offset="1336" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM14_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM14_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM14_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM14_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM15_HALTEN" acronym="CONTROLSS_CTRL_EPWM15_HALTEN" offset="1340" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM15_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM15_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM15_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM15_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM16_HALTEN" acronym="CONTROLSS_CTRL_EPWM16_HALTEN" offset="1344" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM16_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM16_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM16_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM16_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM17_HALTEN" acronym="CONTROLSS_CTRL_EPWM17_HALTEN" offset="1348" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM17_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM17_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM17_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM17_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM18_HALTEN" acronym="CONTROLSS_CTRL_EPWM18_HALTEN" offset="1352" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM18_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM18_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM18_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM18_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM19_HALTEN" acronym="CONTROLSS_CTRL_EPWM19_HALTEN" offset="1356" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM19_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM19_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM19_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM19_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM20_HALTEN" acronym="CONTROLSS_CTRL_EPWM20_HALTEN" offset="1360" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM20_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM20_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM20_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM20_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM21_HALTEN" acronym="CONTROLSS_CTRL_EPWM21_HALTEN" offset="1364" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM21_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM21_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM21_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM21_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM22_HALTEN" acronym="CONTROLSS_CTRL_EPWM22_HALTEN" offset="1368" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM22_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM22_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM22_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM22_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
