ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	</register><register id="CONTROLSS_CTRL_EPWM23_HALTEN" acronym="CONTROLSS_CTRL_EPWM23_HALTEN" offset="1372" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM23_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM23_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM23_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM23_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM24_HALTEN" acronym="CONTROLSS_CTRL_EPWM24_HALTEN" offset="1376" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM24_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM24_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM24_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM24_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM25_HALTEN" acronym="CONTROLSS_CTRL_EPWM25_HALTEN" offset="1380" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM25_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM25_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM25_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM25_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM26_HALTEN" acronym="CONTROLSS_CTRL_EPWM26_HALTEN" offset="1384" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM26_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM26_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM26_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM26_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM27_HALTEN" acronym="CONTROLSS_CTRL_EPWM27_HALTEN" offset="1388" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM27_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM27_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM27_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM27_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM28_HALTEN" acronym="CONTROLSS_CTRL_EPWM28_HALTEN" offset="1392" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM28_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM28_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM28_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM28_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM29_HALTEN" acronym="CONTROLSS_CTRL_EPWM29_HALTEN" offset="1396" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM29_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM29_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM29_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM29_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM30_HALTEN" acronym="CONTROLSS_CTRL_EPWM30_HALTEN" offset="1400" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM30_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM30_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM30_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM30_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EPWM31_HALTEN" acronym="CONTROLSS_CTRL_EPWM31_HALTEN" offset="1404" width="32" description="Epwm halt enable.">
		<bitfield id="EPWM31_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EPWM31_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EPWM31_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EPWM31_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA0_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA0_HALTEN" offset="1408" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA1_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA1_HALTEN" offset="1412" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA2_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA2_HALTEN" offset="1416" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA3_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA3_HALTEN" offset="1420" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA4_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA4_HALTEN" offset="1424" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA5_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA5_HALTEN" offset="1428" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA6_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA6_HALTEN" offset="1432" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA7_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA7_HALTEN" offset="1436" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA8_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA8_HALTEN" offset="1440" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSA9_HALTEN" acronym="CONTROLSS_CTRL_CMPSSA9_HALTEN" offset="1444" width="32" description="cmpssa halt enable.">
		<bitfield id="CMPSSA9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSA9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB0_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB0_HALTEN" offset="1448" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB1_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB1_HALTEN" offset="1452" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB2_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB2_HALTEN" offset="1456" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
