ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/CONTROLSS_GLOBAL_CTRL_CONTROLSS_CTRL_502F0000h.xml
	</register><register id="CONTROLSS_CTRL_CMPSSB3_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB3_HALTEN" offset="1460" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB4_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB4_HALTEN" offset="1464" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB5_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB5_HALTEN" offset="1468" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB6_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB6_HALTEN" offset="1472" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB7_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB7_HALTEN" offset="1476" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB8_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB8_HALTEN" offset="1480" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_CMPSSB9_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB9_HALTEN" offset="1484" width="32" description="cmpssb halt enable.">
		<bitfield id="CMPSSB9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="CMPSSB9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP0_HALTEN" acronym="CONTROLSS_CTRL_ECAP0_HALTEN" offset="1488" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP1_HALTEN" acronym="CONTROLSS_CTRL_ECAP1_HALTEN" offset="1492" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP2_HALTEN" acronym="CONTROLSS_CTRL_ECAP2_HALTEN" offset="1496" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP3_HALTEN" acronym="CONTROLSS_CTRL_ECAP3_HALTEN" offset="1500" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP3_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP3_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP4_HALTEN" acronym="CONTROLSS_CTRL_ECAP4_HALTEN" offset="1504" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP4_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP4_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP4_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP4_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP5_HALTEN" acronym="CONTROLSS_CTRL_ECAP5_HALTEN" offset="1508" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP5_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP5_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP5_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP5_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP6_HALTEN" acronym="CONTROLSS_CTRL_ECAP6_HALTEN" offset="1512" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP6_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP6_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP6_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP6_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP7_HALTEN" acronym="CONTROLSS_CTRL_ECAP7_HALTEN" offset="1516" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP7_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP7_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP7_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP7_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP8_HALTEN" acronym="CONTROLSS_CTRL_ECAP8_HALTEN" offset="1520" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP8_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP8_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP8_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP8_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_ECAP9_HALTEN" acronym="CONTROLSS_CTRL_ECAP9_HALTEN" offset="1524" width="32" description="Ecap halt enable.">
		<bitfield id="ECAP9_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="ECAP9_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="ECAP9_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="ECAP9_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP0_HALTEN" acronym="CONTROLSS_CTRL_EQEP0_HALTEN" offset="1528" width="32" description="Eqep halt enable.">
		<bitfield id="EQEP0_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EQEP0_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EQEP0_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EQEP0_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP1_HALTEN" acronym="CONTROLSS_CTRL_EQEP1_HALTEN" offset="1532" width="32" description="Eqep halt enable.">
		<bitfield id="EQEP1_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EQEP1_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EQEP1_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EQEP1_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_EQEP2_HALTEN" acronym="CONTROLSS_CTRL_EQEP2_HALTEN" offset="1536" width="32" description="Eqep halt enable.">
		<bitfield id="EQEP2_HALTEN_CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="R/W"/>
	<bitfield id="EQEP2_HALTEN_CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="R/W"/>
	<bitfield id="EQEP2_HALTEN_CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="R/W"/>
	<bitfield id="EQEP2_HALTEN_CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0: IP Halt disabled with corresponding CPU haltWrite 1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_LOCK0_KICK0" acronym="CONTROLSS_CTRL_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_LOCK0_KICK1" acronym="CONTROLSS_CTRL_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_CTRL_INTR_RAW_STATUS" acronym="CONTROLSS_CTRL_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="CONTROLSS_CTRL_INTR_ENABLED_STATUS_CLEAR" acronym="CONTROLSS_CTRL_INTR_ENABLED_STATUS_CLEAR" offset="4116" width="32" description="Interrupt Enabled Status/Clear register.">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
